import Head from 'next/head';
import Image from 'next/image';
import Link from 'next/link';

import { ADDRESS_ROUTE } from '../utils/consts';
import styles from '../styles/Contacts.module.css';

export default function Contacts() {
    return (
        <>
            <Head>
                <title>Контакты | M88 - Онлайн Магазин Женской обуви в Ташкенте</title>
            </Head>

            <main className='main'>
                <div className={styles.imgContainer}>
                    <Image src='/img/contact-title-img.jpg' layout='fill' objectFit='cover' objectPosition='center 35%' alt='Contact Us' />
                </div>
                <div className={styles.container}>
                    <h1 className={styles.contactTitle}>Контакты</h1>
                    <p className={styles.contactSubtitle}>Вы можете связаться с нами любым удобным Вам способом!</p>
                    <div className={styles.contactsContainer}>
                        <Link href='tel:998983611008'>
                            <a>
                                <div className={styles.boxPhone}>
                                    <div className={styles.boxIcon}>
                                        <svg width="54" height="54" viewBox="0 0 54 54" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="27" cy="27" r="26.5" fill="white" stroke="black"/>
                                            <path d="M35.744 42.9999C35.4325 42.9991 35.122 42.9652 34.8178 42.899C29.0263 41.7121 23.6908 38.9293 19.4254 34.8708C15.2509 30.8033 12.3558 25.6246 11.0901 19.9612C10.9409 19.2553 10.9775 18.5233 11.1965 17.8356C11.4154 17.1478 11.8094 16.5275 12.3404 16.0342L16.045 12.5018C16.2342 12.3245 16.459 12.1887 16.7048 12.1034C16.9505 12.018 17.2117 11.9849 17.4712 12.0063C17.7403 12.0341 18 12.12 18.232 12.2579C18.464 12.3958 18.6627 12.5824 18.8141 12.8046L23.4448 19.585C23.6185 19.8481 23.7023 20.1594 23.684 20.4733C23.6656 20.7871 23.5461 21.0868 23.3429 21.3283L21.0183 24.0808C21.9441 26.1108 23.2553 27.9454 24.8803 29.485C26.4949 31.0803 28.4032 32.3542 30.502 33.2376L33.3823 30.9713C33.6242 30.7819 33.9186 30.6699 34.2263 30.6503C34.534 30.6306 34.8405 30.7042 35.1049 30.8612L42.0973 35.3387C42.3372 35.4806 42.5417 35.6745 42.6952 35.9058C42.8488 36.1372 42.9476 36.3999 42.9841 36.6744C43.0206 36.9489 42.994 37.228 42.9062 37.4909C42.8184 37.7537 42.6716 37.9935 42.477 38.1922L38.8651 41.7338C38.4548 42.1382 37.9678 42.4583 37.4321 42.6756C36.8965 42.8929 36.3228 43.0031 35.744 42.9999ZM17.323 13.823L13.6185 17.3554C13.3197 17.6312 13.0986 17.9792 12.9768 18.3653C12.855 18.7514 12.8368 19.1623 12.9239 19.5575C14.1007 24.8718 16.806 29.7348 20.7127 33.5587C24.7268 37.377 29.7478 39.9945 35.1975 41.1099C35.61 41.1953 36.0375 41.178 36.4416 41.0595C36.8457 40.941 37.2138 40.725 37.5129 40.4309L41.1248 36.8893L34.3733 32.5678L31.28 35.0084C31.1615 35.1012 31.022 35.164 30.8735 35.1912C30.725 35.2184 30.572 35.2092 30.4279 35.1644C27.8595 34.2268 25.5318 32.7386 23.6115 30.8062C21.6253 28.9686 20.0835 26.7104 19.1012 24.2001C19.0597 24.0481 19.0583 23.8881 19.0972 23.7354C19.1361 23.5828 19.2141 23.4426 19.3235 23.3284L21.8241 20.3649L17.323 13.823Z" fill="black"/>
                                        </svg>
                                    </div>
                                    <div className={styles.boxTitle}>Телефон</div>
                                    <div className={styles.boxInfo}>+998 98 361 10 08</div>
                                </div>
                            </a>
                        </Link>
                        <Link href={ADDRESS_ROUTE}>
                            <a>
                                <div className={styles.boxAddress}>
                                    <div className={styles.boxIcon}>
                                        <svg width="54" height="54" viewBox="0 0 54 54" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="27" cy="27" r="26.5" fill="white" stroke="black"/>
                                            <path d="M27 29.125C25.9493 29.125 24.9222 28.8134 24.0485 28.2297C23.1749 27.6459 22.494 26.8162 22.0919 25.8455C21.6898 24.8748 21.5846 23.8066 21.7896 22.7761C21.9946 21.7456 22.5005 20.799 23.2435 20.056C23.9865 19.313 24.9331 18.8071 25.9636 18.6021C26.9941 18.3971 28.0623 18.5023 29.033 18.9044C30.0037 19.3065 30.8334 19.9874 31.4172 20.861C32.0009 21.7347 32.3125 22.7618 32.3125 23.8125C32.3108 25.2209 31.7506 26.5712 30.7546 27.5671C29.7587 28.5631 28.4084 29.1233 27 29.125V29.125ZM27 20.625C26.3696 20.625 25.7533 20.8119 25.2291 21.1622C24.7049 21.5124 24.2964 22.0103 24.0551 22.5927C23.8139 23.1751 23.7508 23.816 23.8737 24.4344C23.9967 25.0527 24.3003 25.6206 24.7461 26.0664C25.1919 26.5122 25.7598 26.8158 26.3782 26.9388C26.9965 27.0617 27.6374 26.9986 28.2198 26.7574C28.8022 26.5161 29.3001 26.1076 29.6503 25.5834C30.0006 25.0592 30.1875 24.4429 30.1875 23.8125C30.1867 22.9674 29.8506 22.1571 29.253 21.5595C28.6554 20.9619 27.8451 20.6258 27 20.625V20.625Z" fill="black"/>
                                            <path d="M27 41.875L18.0368 31.3042C17.9122 31.1455 17.789 30.9857 17.667 30.825C16.1359 28.8081 15.3088 26.3447 15.3125 23.8125C15.3125 20.7128 16.5439 17.74 18.7357 15.5482C20.9275 13.3564 23.9003 12.125 27 12.125C30.0997 12.125 33.0725 13.3564 35.2643 15.5482C37.4562 17.74 38.6875 20.7128 38.6875 23.8125C38.6912 26.3435 37.8645 28.8059 36.3341 30.8218L36.333 30.825C36.333 30.825 36.0143 31.2436 35.9664 31.2999L27 41.875ZM19.3628 29.5447C19.3649 29.5447 19.6114 29.8719 19.6677 29.9421L27 38.5898L34.3419 29.9304C34.3886 29.8719 34.6373 29.5426 34.6383 29.5415C35.889 27.8937 36.565 25.8812 36.5625 23.8125C36.5625 21.2764 35.555 18.8441 33.7617 17.0508C31.9684 15.2575 29.5361 14.25 27 14.25C24.4639 14.25 22.0316 15.2575 20.2383 17.0508C18.445 18.8441 17.4375 21.2764 17.4375 23.8125C17.4353 25.8825 18.112 27.8961 19.3638 29.5447H19.3628Z" fill="black"/>
                                        </svg>
                                    </div>
                                    <div className={styles.boxTitle}>Адрес</div>
                                    <div className={styles.boxInfo}>Чиланзарский рынок "АБУ-САХИЙ", пр-т БУНЁДКОР,  999A</div>
                                </div>
                            </a>
                        </Link>
                        <Link href='mailto:hello@m88.uz'>
                            <a>
                                <div className={styles.boxMail}>
                                    <div className={styles.boxIcon}>
                                        <svg width="54" height="54" viewBox="0 0 54 54" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="27" cy="27" r="26.5" fill="white" stroke="black"/>
                                            <path d="M32.9182 27.471L40.3506 21.0137V33.8547L32.9182 27.471ZM23.3409 28.5646L25.9509 30.8302C26.3605 31.1782 26.8946 31.3885 27.4783 31.3885H27.4988H27.4976H27.5145C28.0993 31.3885 28.6334 31.177 29.0479 30.8266L29.0443 30.829L31.6543 28.5634L39.5882 35.3772H15.4106L23.3409 28.5646ZM15.3997 19.4827H39.6027L27.9773 29.5796C27.8466 29.683 27.6848 29.7392 27.5181 29.7391H27.5012H27.5024H27.4855C27.3183 29.7393 27.1559 29.6826 27.0251 29.5784L27.0263 29.5796L15.3997 19.4827ZM14.6494 21.0125L22.0806 27.4698L14.6494 33.8498V21.0125ZM40.7494 18.063C40.4594 17.918 40.1186 17.8334 39.7573 17.8334H15.2463C14.8961 17.8335 14.5507 17.9149 14.2373 18.0714L14.2506 18.0654C13.8755 18.2504 13.5596 18.5366 13.3386 18.8917C13.1176 19.2468 13.0003 19.6566 13 20.0748V34.7827C13.0006 35.3779 13.2374 35.9486 13.6583 36.3695C14.0792 36.7904 14.6498 37.0271 15.2451 37.0278H39.7537C40.3489 37.0271 40.9196 36.7904 41.3405 36.3695C41.7614 35.9486 41.9982 35.3779 41.9988 34.7827V20.0748C41.9988 19.1964 41.4925 18.4351 40.7554 18.069L40.7421 18.063H40.7494Z" fill="black"/>
                                        </svg>
                                    </div>
                                    <div className={styles.boxTitle}>Почта</div>
                                    <div className={styles.boxInfo}>hello@m88.uz</div>
                                </div>
                            </a>
                        </Link>
                    </div>
                    <div className={styles.faqContainer}>
                        <h2 className={styles.faqTitle}>Часто задаваемые вопросы</h2>
                        <details className={styles.details} open>
                            <summary className={styles.summary}>Когда будут скидки и акции?</summary>
                            <p>
                                Подписывайтесь на наши социальные сети, мы всегда анонсируем новости о скидках и акциях. Также можете оставить свой номер телефона, мы будем отправлять вам сообщения с новостями
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>У вас вся обувь кожаная?</summary>
                            <p>
                                Все модели, представленные в ассортименте «M88» из натуральной кожи
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>Почему кожаные мокасины быстро теряют форму и цвет?</summary>
                            <p>
                                Натуральная кожа имеет свойство разнашиваться со временем. Также как и терять цвет. 
                                Поэтому не советуется кожаную обувь одевать в дождливую погоду
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>Я хочу вернуть свою покупку! Что мне делать?</summary>
                            <p>
                                Вы можете вернуть купленный товар в течение 15 дней с момента покупки в любой удобный для вас филиал или заказать возврат на дом посредством службы поддержки клиентов «M88»<br/><br/>
                                Важно! Товар должен быть в том состоянии, в котором вы его получили, в оригинальной упаковке, а так же нужно предоставить чек
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>Я обнаружил(а) производственный брак, каковы дальнейшие действия?</summary>
                            <p>
                                Если вы обнаружили производственный брак: <br/>
                                – свяжитесь с нами по одному из любых каналов связи; <br/>
                                – звоните по номеру +998 98 361 10 08 или +998 90 009 08 85; <br/>
                                – приходите в любой из наших филиалов Ташкента; <br/>
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>Я оформил(а) заказ, через сколько мне ждать звонка?</summary>
                            <p>
                                После оформления заказа операторы перезванивают в течении часа. Если с вами не связались, вы можете написать нам в Telegram или позвонить по номеру +998 98 361 10 08
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>Я оформил(а) заказ, когда мне его доставят?</summary>
                            <p>
                                Доставка по Ташкенту осуществляется в течение 48 часов после оформления заказа. Курьер доставляет с 11:00 до 21:00
                            </p>
                        </details>
                        <details className={styles.details}>
                            <summary className={styles.summary}>Могу ли я заказать несколько пар обуви и купить только одну?</summary>
                            <p>
                                Конечно! Вы можете попробовать бесплатную примерку дома.
                                При заказе обуви советуем добавить в корзину минимум еще 1 дополнительный размер для более точного подбора<br/><br/>
                                Наши консультанты всегда рады помочь вам в подборе правильного размера!
                            </p>
                        </details>
                    </div>
                </div>
            </main>
        </>
    );
};